![png](booksERD.png)

In [32]:
import pymysql
pymysql.install_as_MySQLdb()

In [33]:
from sqlalchemy import create_engine
import pandas as pd
from urllib.parse import quote_plus
from sqlalchemy import text

In [34]:
# Create the sqlalchemy engine and connection
username = "root"
password = quote_plus("Vis688131!") 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "Books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [35]:
q = """SELECT * FROM books;"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, title, author_id, created_at, updated_at]
Index: []

In [36]:
df = pd.read_csv('RawData/Customers_favorite_books - Customers_favorite_books.csv')
df.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [37]:
q = '''DESCRIBE Users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key            Default              Extra
0          id          int   NO  PRI               None     auto_increment
1  first_name  varchar(45)  YES                    None
2   last_name  varchar(45)  YES                    None
3       email  varchar(45)  YES                    None
4  created_at     datetime  YES       CURRENT_TIMESTAMP  DEFAULT_GENERATED
5  updated_at     datetime  YES       CURRENT_TIMESTAMP  DEFAULT_GENERATED

In [38]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'first_name', 'last_name', 'email', 'created_at',
       'updated_at'], dtype=object)

In [39]:
df.columns

Index(['First Name', 'Last Name', 'Email', 'Book Title', 'Book Author'], dtype='object')

In [40]:
df.columns.str.lower()

Index(['first name', 'last name', 'email', 'book title', 'book author'], dtype='object')

In [41]:
df.columns = df.columns.str.lower()

In [42]:
df.head()

,first name,last name,email,book title,book author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [43]:
## change book title to title, and book_author to author_name

In [44]:
df = df.rename(columns={'book title': 'title',
              'book author': 'author_name',
                       'first name':'first_name',
                       'last name':'last_name'})

In [45]:
df.head()

,first_name,last_name,email,title,author_name
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [46]:
describe[['Field','Type']]

        Field         Type
0          id          int
1  first_name  varchar(45)
2   last_name  varchar(45)
3       email  varchar(45)
4  created_at     datetime
5  updated_at     datetime

In [47]:
df.dtypes

first_name     object
last_name      object
email          object
title          object
author_name    object
dtype: object

In [48]:
q = """SELECT * FROM users;"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, first_name, last_name, email, created_at, updated_at]
Index: []

In [49]:
df.head()

,first_name,last_name,email,title,author_name
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [50]:
users = df.copy()

In [59]:
books = df.copy()

In [51]:
users.head()

,first_name,last_name,email,title,author_name
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [60]:
books.head()

,first_name,last_name,email,title,author_name
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [52]:
users = users.drop(columns='title')

In [53]:
users = users.drop(columns='author_name')

In [62]:
books = books.drop(columns='email')

In [64]:
books = books.drop(columns='first_name')

In [63]:
books = books.drop(columns='last_name')

In [66]:
books = books.drop(columns='author_name')

## Dtypes between DF and SQL are matched

In [54]:
users.to_sql("users",conn,index=False, if_exists='append')

7

In [67]:
books.to_sql("books",conn,index=False, if_exists='append')

7

In [68]:
q = """SHOW TABLES """
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [69]:
q = """SELECT * FROM users;"""
pd.read_sql(q, conn)

,id,first_name,last_name,email,created_at,updated_at
0,1,John,Doe,JD@books.com,2023-10-01 14:35:39,2023-10-01 14:35:39
1,2,John,Doe,JD@books.com,2023-10-01 14:35:39,2023-10-01 14:35:39
2,3,John,Doe,JD@books.com,2023-10-01 14:35:39,2023-10-01 14:35:39
3,4,Robin,Smith,Robin@books.com,2023-10-01 14:35:39,2023-10-01 14:35:39
4,5,Robin,Smith,Robin@books.com,2023-10-01 14:35:39,2023-10-01 14:35:39
5,6,Gloria,Rodriguez,grodriguez@books.com,2023-10-01 14:35:39,2023-10-01 14:35:39
6,7,Gloria,Rodriguez,grodriguez@books.com,2023-10-01 14:35:39,2023-10-01 14:35:39

In [72]:
q = """SELECT * FROM books;"""
pd.read_sql(q, conn)

   id                 title author_id          created_at          updated_at
0   1           The Shining      None 2023-10-01 14:37:57 2023-10-01 14:37:57
1   2                    It      None 2023-10-01 14:37:57 2023-10-01 14:37:57
2   3      The Great Gatsby      None 2023-10-01 14:37:57 2023-10-01 14:37:57
3   4  The Call of the Wild      None 2023-10-01 14:37:57 2023-10-01 14:37:57
4   5   Pride and Prejudice      None 2023-10-01 14:37:57 2023-10-01 14:37:57
5   6   Pride and Prejudice      None 2023-10-01 14:37:57 2023-10-01 14:37:57
6   7          Frankenstein      None 2023-10-01 14:37:57 2023-10-01 14:37:57

In [70]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q,conn)

OperationalError: (pymysql.err.OperationalError) (1054, "Unknown column 'favorites.user_id' in 'field list'")
[SQL: SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id =
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));]
(Background on this error at: https://sqlalche.me/e/14/e3q8)